---
kind: type
id: T:Autodesk.Revit.DB.MEPCurveType
source: html/97c98bd6-0966-5b0c-6f75-4c34f16adce1.htm
---
# Autodesk.Revit.DB.MEPCurveType

The base type class for MEP curves, such as ducts, pipes, cable trays and conduits.

## Syntax (C#)
```csharp
public class MEPCurveType : HostObjAttributes
```